In [1]:
import pandas as pd
import os

In [2]:
hawkercentre = pd.read_csv('hawker-centres-kml.csv')
hawkercentre.head(5)

,Name,LATITUDE,LONGITUDE,ADDRESSPOSTALCODE
0,Ci Yuan Hawker Centre,1.374938,103.882947,538776
1,West Coast Drive Blk 502 (Ayer Rajah Market),1.311960,103.759102,120502
2,West Coast Drive Blk 503 (Ayer Rajah Food Centre),1.311870,103.759804,120503
3,Bedok South Road Blk 16,1.320560,103.935547,460016
4,Pasir Ris Central Hawker Centre,1.373318,103.951364,519641

In [3]:
hawkercentre = hawkercentre.rename(columns = {'Name': 'name', 'LATITUDE': 'latitude', 'LONGITUDE': 'longitude'})
hawkercentre = hawkercentre.drop(columns = 'ADDRESSPOSTALCODE')
hawkercentre['type'] = 'hawkercentre'
hawkercentre.head(5)

,name,latitude,longitude,type
0,Ci Yuan Hawker Centre,1.374938,103.882947,hawkercentre
1,West Coast Drive Blk 502 (Ayer Rajah Market),1.311960,103.759102,hawkercentre
2,West Coast Drive Blk 503 (Ayer Rajah Food Centre),1.311870,103.759804,hawkercentre
3,Bedok South Road Blk 16,1.320560,103.935547,hawkercentre
4,Pasir Ris Central Hawker Centre,1.373318,103.951364,hawkercentre

In [4]:
final_hawkercentre = hawkercentre
final_hawkercentre.to_csv('final_hawkercentre.csv', index = False, sep = ',', encoding = 'utf-8')

In [5]:
parks_playgrounds = pd.read_csv('parks_playgrounds.csv')
parks_playgrounds.head(5)

                            NAME   Longitude  Latitude
0               Telok Ayer Green  103.847644  1.281465
1  Mayflower Crescent Playground  103.839569  1.372718
2     Sunrise Drive Playground 1  103.857370  1.388306
3       Elias Terrace Playground  103.941094  1.372190
4          Kew Avenue Playground  103.948451  1.321627

In [6]:
parks_playgrounds = parks_playgrounds.rename(columns = {'NAME': 'name', 'Latitude': 'latitude', 'Longitude': 'longitude'})
parks_playgrounds['type'] = 'parks_playgrounds'
parks_playgrounds.head(5)

                            name   longitude  latitude               type
0               Telok Ayer Green  103.847644  1.281465  parks_playgrounds
1  Mayflower Crescent Playground  103.839569  1.372718  parks_playgrounds
2     Sunrise Drive Playground 1  103.857370  1.388306  parks_playgrounds
3       Elias Terrace Playground  103.941094  1.372190  parks_playgrounds
4          Kew Avenue Playground  103.948451  1.321627  parks_playgrounds

In [7]:
final_parks_playgrounds = parks_playgrounds
final_parks_playgrounds.to_csv('final_parks_playgrounds.csv', index = False, sep = ',', encoding = 'utf-8')

In [8]:
supermarket = pd.read_csv('supermarket.csv')
supermarket.head(5)

,LIC_NAME,STR_NAME,lng,lat
0,LI LI CHENG SUPERMARKET (PUNGGOL) PTE. LTD.,PUNGGOL PLACE,103.901262,1.402303
1,SHENG SIONG SUPERMARKET PTE LTD,UPPER BOON KENG ROAD,103.870914,1.314239
2,COLD STORAGE SINGAPORE (1983) PTE LTD,HOUGANG AVENUE 8,103.886366,1.373321
3,COLD STORAGE SINGAPORE (1983) PTE LTD,BEDOK RESERVOIR ROAD,103.914942,1.332959
4,YES SUPERMARKET PTE LTD,TAMPINES STREET 21,103.953010,1.353453

In [9]:
supermarket = supermarket.rename(columns = {'LIC_NAME': 'name', 'lat': 'latitude', 'lng': 'longitude'})
supermarket = supermarket.drop(columns = 'STR_NAME')
supermarket['type'] = 'supermarket'
supermarket.head(5)

,name,longitude,latitude,type
0,LI LI CHENG SUPERMARKET (PUNGGOL) PTE. LTD.,103.901262,1.402303,supermarket
1,SHENG SIONG SUPERMARKET PTE LTD,103.870914,1.314239,supermarket
2,COLD STORAGE SINGAPORE (1983) PTE LTD,103.886366,1.373321,supermarket
3,COLD STORAGE SINGAPORE (1983) PTE LTD,103.914942,1.332959,supermarket
4,YES SUPERMARKET PTE LTD,103.953010,1.353453,supermarket

In [10]:
final_supermarket = supermarket
final_supermarket.to_csv('final_supermarket.csv', index = False, sep = ',', encoding = 'utf-8')

In [11]:
final_hawkercentre.count()

name         118
latitude     118
longitude    118
type         118
dtype: int64

In [12]:
final_parks_playgrounds.count()

name         346
longitude    346
latitude     346
type         346
dtype: int64

In [13]:
final_supermarket.count()

name         526
longitude    526
latitude     526
type         526
dtype: int64

In [14]:
combined_csv = pd.concat([final_hawkercentre, final_parks_playgrounds, final_supermarket], axis = 0)
combined_csv.head()

,name,latitude,longitude,type
0,Ci Yuan Hawker Centre,1.374938,103.882947,hawkercentre
1,West Coast Drive Blk 502 (Ayer Rajah Market),1.311960,103.759102,hawkercentre
2,West Coast Drive Blk 503 (Ayer Rajah Food Centre),1.311870,103.759804,hawkercentre
3,Bedok South Road Blk 16,1.320560,103.935547,hawkercentre
4,Pasir Ris Central Hawker Centre,1.373318,103.951364,hawkercentre

In [15]:
combined_csv.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 990 entries, 0 to 525
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       990 non-null    object
 1   latitude   990 non-null    float64
 2   longitude  990 non-null    float64
 3   type       990 non-null    object
dtypes: float64(2), object(2)
memory usage: 38.7+ KB

In [16]:
combined_csv.to_csv('combined_csv.csv', index = False, sep = ',', encoding = 'utf-8')